#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

module.eks.data.aws_iam_role.name: Reading...
module.eks.data.aws_vpcs.selected: Reading...
data.aws_iam_role.name: Reading...
data.aws_iam_role.name: Read complete after 1s [id=LabRole]
module.eks.data.aws_iam_role.name: Read complete after 1s [id=LabRole]
module.eks.data.aws_vpcs.selected: Read complete after 1s [id=us-east-1]
module.eks.data.aws_subnets.selected: Reading...
module.eks.data.aws_subnets.selected: Read complete after 0s [id=us-east-1]
module.eks.data.aws_subnet.selected["subnet-0f23f4d26e5ef5c04"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0601f7a24b959af3a"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0d6f4613a622a09b7"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0f1deffe23691cbea"]: Reading...
module.eks.data.aws_subnet.selected["subnet-086b6c0147233cbbd"]: Reading...
module.eks.data.aws_subnet.selected["subnet-03f7ef57b189f4875"]: Reading...
module.eks.data.aws_subnet.selected["subnet-0f23f4d26e5ef5c04"]: Read complete after 0s [id=subnet-0f23f4d26e5ef5c04]
module.eks.data.aws_subnet.selected["subnet-03f7ef57b189f4875"]: Read complete after 0s [id=subnet-03f7ef57b189f4875]
module.eks.data.aws_subnet.selected["subnet-0d6f4613a622a09b7"]: Read complete after 0s [id=subnet-0d6f4613a622a09b7]
module.eks.data.aws_subnet.selected["subnet-0601f7a24b959af3a"]: Read complete after 0s [id=subnet-0601f7a24b959af3a]
module.eks.data.aws_subnet.selected["subnet-0f1deffe23691cbea"]: Read complete after 0s [id=subnet-0f1deffe23691cbea]
module.eks.data.aws_subnet.selected["subnet-086b6c0147233cbbd"]: Read complete after 0s [id=subnet-086b6c0147233cbbd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cognito.aws_cognito_user_pool.tech_lanches_clientes_pool will be created
  + resource "aws_cognito_user_pool" "tech_lanches_clientes_pool" {
      + alias_attributes           = [
          + "email",
          + "preferred_username",
        ]
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "tech-lanches-clientes-pool"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Name" = "tech_lanches_clientes_pool"
        }
      + tags_all                   = {
          + "Name" = "tech_lanches_clientes_pool"
        }

      + username_configuration {
          + case_sensitive = false
        }
    }

  # module.cognito.aws_cognito_user_pool_client.tech_lanches_clientes_pool_client will be created
  + resource "aws_cognito_user_pool_client" "tech_lanches_clientes_pool_client" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "pool-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # module.cognito.aws_secretsmanager_secret.lambda_auth_credentials will be created
  + resource "aws_secretsmanager_secret" "lambda_auth_credentials" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "lambda-auth-credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)
    }

  # module.cognito.aws_secretsmanager_secret_version.lambda_auth_credentials will be created
  + resource "aws_secretsmanager_secret_version" "lambda_auth_credentials" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.dynamoDb.aws_dynamodb_table.pagamentos will be created
  + resource "aws_dynamodb_table" "pagamentos" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "Id"
      + id               = (known after apply)
      + name             = "pagamentos"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "DynamoDB do TechLanches Serviço de Pagamento"
          + "Repository"  = "https://github.com/g12-4soat/techlanches-iac"
        }
      + tags_all         = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "DynamoDB do TechLanches Serviço de Pagamento"
          + "Repository"  = "https://github.com/g12-4soat/techlanches-iac"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Id"
          + type = "S"
        }
      + attribute {
          + name = "PedidoId"
          + type = "N"
        }

      + global_secondary_index {
          + hash_key           = "PedidoId"
          + name               = "pedidoIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
        }
    }

  # module.eks.data.aws_security_group.eks-sg will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_group" "eks-sg" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)
    }

  # module.eks.aws_eks_addon.aws_ebs_csi_driver will be created
  + resource "aws_eks_addon" "aws_ebs_csi_driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.28.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-techlanches"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "NONE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.core_dns will be created
  + resource "aws_eks_addon" "core_dns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.1-eksbuild.4"
      + arn                         = (known after apply)
      + cluster_name                = "eks-techlanches"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.29.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-techlanches"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.16.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-techlanches"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_cluster.eks-techlanches will be created
  + resource "aws_eks_cluster" "eks-techlanches" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "eks-techlanches"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::672154718861:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.29"

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "10.100.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-03f7ef57b189f4875",
              + "subnet-0601f7a24b959af3a",
              + "subnet-086b6c0147233cbbd",
              + "subnet-0f1deffe23691cbea",
              + "subnet-0f23f4d26e5ef5c04",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.techlanches-node will be created
  + resource "aws_eks_node_group" "techlanches-node" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eks-techlanches"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "c3.xlarge",
        ]
      + node_group_name        = "techlanches-node"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::672154718861:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-03f7ef57b189f4875",
          + "subnet-0601f7a24b959af3a",
          + "subnet-086b6c0147233cbbd",
          + "subnet-0f1deffe23691cbea",
          + "subnet-0f23f4d26e5ef5c04",
        ]
      + tags_all               = (known after apply)
      + version                = "1.29"

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }
    }

  # module.eks.aws_security_group.eks-sg will be created
  + resource "aws_security_group" "eks-sg" {
      + arn                    = (known after apply)
      + description            = "Default security group for the EKS cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-default-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.allow_eks_to_rds will be created
  + resource "aws_security_group_rule" "allow_eks_to_rds" {
      + from_port                = 1433
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 1433
      + type                     = "ingress"
    }

  # module.rds.aws_db_instance.mssql-techlanches-instance will be created
  + resource "aws_db_instance" "mssql-techlanches-instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "sqlserver-ex"
      + engine_version                        = "15.00.4043.16.v1"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "mssql-techlanches-instance"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.medium"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.sqlserver-ex-15.0"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "MSSQL Server do TechLanches Serviço de Pedidos e Produtos"
          + "Repository"  = "https://github.com/g12-4soat/techlanches-iac"
        }
      + tags_all                              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "MSSQL Server do TechLanches Serviço de Pedidos e Produtos"
          + "Repository"  = "https://github.com/g12-4soat/techlanches-iac"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {
          + create = "15m"
          + delete = "15m"
          + update = "15m"
        }
    }

  # module.rds.aws_secretsmanager_secret.rds_credentials will be created
  + resource "aws_secretsmanager_secret" "rds_credentials" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "database-credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)
    }

  # module.rds.aws_secretsmanager_secret_version.rds_credentials will be created
  + resource "aws_secretsmanager_secret_version" "rds_credentials" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.rds.random_password.master_password will be created
  + resource "random_password" "master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @nsosoares, Action: `pull_request`*